# ShowElements Method (ElementId)

---
C#Visual BasicVisual C++
Revit 2024 API
---
UIDocument..::..ShowElements Method (ElementId)
UIDocument Class See Also
---
Shows the element by zoom to fit.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void ShowElements(
	ElementId elementId
)
```

Visual Basic
---
```text
Public Sub ShowElements ( _
	elementId As ElementId _
)
```

Visual C++
---
```text
public:
void ShowElements(
	ElementId^ elementId
)
```

# ### Parameters
elementId
    Type: Autodesk.Revit.DB..::..ElementIdElement id that will be shown.
# Remarks
Places the element in the center of screen by moving the view.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | Element id is not valid. |

# See Also
UIDocument Class
ShowElements Overload
Autodesk.Revit.UI Namespace